import create_trainer as ct



def start_menu():
    print("""
░█████████             ░██                                                        
░██     ░██            ░██                                                        
░██     ░██  ░███████  ░██    ░██ ░███████  ░█████████████   ░███████  ░████████  
░█████████  ░██    ░██ ░██   ░██ ░██    ░██ ░██   ░██   ░██ ░██    ░██ ░██    ░██ 
░██         ░██    ░██ ░███████  ░█████████ ░██   ░██   ░██ ░██    ░██ ░██    ░██ 
░██         ░██    ░██ ░██   ░██ ░██        ░██   ░██   ░██ ░██    ░██ ░██    ░██ 
░██          ░███████  ░██    ░██ ░███████  ░██   ░██   ░██  ░███████  ░██    ░██ 
                                                                                  
                                                                                  
                                                                                  
░████████                 ░██       ░██    ░██                                    
░██    ░██                ░██       ░██    ░██                                    
░██    ░██   ░██████   ░████████ ░████████ ░██  ░███████                          
░████████         ░██     ░██       ░██    ░██ ░██    ░██                         
░██     ░██  ░███████     ░██       ░██    ░██ ░█████████                         
░██     ░██ ░██   ░██     ░██       ░██    ░██ ░██                                
░█████████   ░█████░██     ░████     ░████ ░██  ░███████                          
                                                                                  
                                                                                  
                                                                                  
  ░██████   ░██                                                                   
 ░██   ░██                                                                        
░██         ░██░█████████████                                                     
 ░████████  ░██░██   ░██   ░██                                                    
        ░██ ░██░██   ░██   ░██                                                    
 ░██   ░██  ░██░██   ░██   ░██                                                    
  ░██████   ░██░██   ░██   ░██                                                    
                                                                                  
                                                                                  
                                                                                  """)

    menu_options = ["single", "multiplayer"]
    global uChoice
    
    uChoice = ""
    
    for i, options in enumerate(menu_options, start = 1):
        print(f"{i}. {options}")
        
    while uChoice not in menu_options:
        uChoice = input("Enter choice: ")
        if uChoice not in menu_options:
            print("Not an option")
            

            
def game_mode():
            

    if uChoice == "single":
        trainer1 = ct.trainer_base()
        print("\n")
        for key, value in trainer1.items():
            print(f"\t{key} : {value}")    
        
    if uChoice == "multiplayer":
        trainer1 = ct.trainer_base()
        trainer2 = ct.trainer_base()
        print("\n")
        for key, value in trainer1.items():
            print(f"\t{key} : {value}")    
        print("\n") 
        for key, value in trainer2.items():
            print(f"\t{key} : {value}")     
    
    if uChoice == "single":
        print("Returning trainer 1 and uchoice")
        return trainer1, uChoice
    if uChoice == "multiplayer":
        print("Returning trainer 1, 2 and uchoice")

        return trainer1, trainer2, uChoice

    
